; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-33)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 17 of 33
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 33
3. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 18 of 33
4. (pick ball16 roomb right)
   deleted: (at ball16 roomb) (free right)
   added: (carry ball16 right)
   goals met: 18 of 33
5. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 18 of 33
6. (drop ball16 room3 right)
   deleted: (carry ball16 right)
   added: (at ball16 room3) (free right)
   goals met: 19 of 33
7. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 19 of 33
8. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 19 of 33
9. (drop ball24 room5 left)
   deleted: (carry ball24 left)
   added: (at ball24 room5) (free left)
   goals met: 20 of 33
10. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 20 of 33
11. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 20 of 33
12. (pick ball14 roomb right)
   deleted: (at ball14 roomb) (free right)
   added: (carry ball14 right)
   goals met: 20 of 33
13. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 20 of 33
14. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 21 of 33
15. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 22 of 33
16. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 22 of 33
17. (pick ball22 room3 right)
   deleted: (at ball22 room3) (free right)
   added: (carry ball22 right)
   goals met: 22 of 33
18. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 22 of 33
19. (drop ball23 room5 left)
   deleted: (carry ball23 left)
   added: (at ball23 room5) (free left)
   goals met: 23 of 33
20. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 23 of 33
21. (drop ball22 room4 right)
   deleted: (carry ball22 right)
   added: (at ball22 room4) (free right)
   goals met: 24 of 33
22. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 24 of 33
23. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 24 of 33
24. (drop ball28 room5 left)
   deleted: (carry ball28 left)
   added: (at ball28 room5) (free left)
   goals met: 25 of 33
25. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 25 of 33
26. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 25 of 33
27. (pick ball12 roomb right)
   deleted: (at ball12 roomb) (free right)
   added: (carry ball12 right)
   goals met: 25 of 33
28. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 25 of 33
29. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 25 of 33
30. (drop ball12 room3 right)
   deleted: (carry ball12 right)
   added: (at ball12 room3) (free right)
   goals met: 26 of 33
31. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 27 of 33
32. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 27 of 33
33. (pick ball20 room3 right)
   deleted: (at ball20 room3) (free right)
   added: (carry ball20 right)
   goals met: 27 of 33
34. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 27 of 33
35. (drop ball20 room4 right)
   deleted: (carry ball20 right)
   added: (at ball20 room4) (free right)
   goals met: 28 of 33
36. (drop ball21 room4 left)
   deleted: (carry ball21 left)
   added: (at ball21 room4) (free left)
   goals met: 29 of 33
37. (pick ball27 room4 left)
   deleted: (at ball27 room4) (free left)
   added: (carry ball27 left)
   goals met: 29 of 33
38. (pick ball26 room4 right)
   deleted: (at ball26 room4) (free right)
   added: (carry ball26 right)
   goals met: 29 of 33
39. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 29 of 33
40. (drop ball26 room5 right)
   deleted: (carry ball26 right)
   added: (at ball26 room5) (free right)
   goals met: 30 of 33
41. (drop ball27 room5 left)
   deleted: (carry ball27 left)
   added: (at ball27 room5) (free left)
   goals met: 31 of 33
42. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 31 of 33
43. (pick ball25 room4 left)
   deleted: (at ball25 room4) (free left)
   added: (carry ball25 left)
   goals met: 31 of 33
44. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 31 of 33
45. (drop ball25 room5 left)
   deleted: (carry ball25 left)
   added: (at ball25 room5) (free left)
   goals met: 32 of 33
46. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 32 of 33
47. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 32 of 33
48. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 32 of 33
49. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 32 of 33
50. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 33 of 33
